<template>
<div>
    <!-- 条款协议 -->
  <div data-v-37bb56c0="" data-v-f531b812="" class="privicy-rule" v-if="type == 5">
    重要提示：在接受这些条款和条件之前，请仔细阅读下面所列出的信息，然后打印和储存这些条款和条件以及与您使用本网站相关的所有交易数据、规则和法规以及付款方式。 <br data-v-37bb56c0="" />
    知晓和接受这些条款和条件构成协议的定制，您通过在此页面上选择“同意”并继续访问网站来接受该协议。当您这样做时，网站的最终用户（简称“玩家”）和（b）公司之间会根据这些条款和条件签订具有法律约束力的协议。 <br data-v-37bb56c0="" />我们还保留在不事先通知的情况下随时更改这些条款和条件的权利。
    <br data-v-37bb56c0="" />一般条款和条件 <br data-v-37bb56c0="" />以下时有关网站使用的条款和条件。网站上的所有玩家活动均受本条款和条件的制约和约束。 <br data-v-37bb56c0="" />定义 <br data-v-37bb56c0="" />下列术语应具有以下含义：
    <p data-v-37bb56c0="">
      投注信息：赛事名称、地点、统计数据、得分、日期和/或时间；赛事相关信息；球队或球员姓名、统计数据及相关信息；赔率；价格；障碍、盘口；投注类型；投注金额；与赌注或投注相关的特定投注、投注类型或投注相关赛事的信息； 公司服务：通过本网站提供的远程赌博或在线博彩设备提供投注、下注和博彩服务；
    </p>
    <p data-v-37bb56c0="">文档：本《条款和条件》、《隐私政策》、《投注条款和规则》</p>
    <p data-v-37bb56c0="">赛事：公司允许的通过本网站和公司服务进行投注的活动、事件、事物或事情；</p>
    <p data-v-37bb56c0="">
      非法行为：应包括但不限于试图规避文件；投注限额；获胜限制；黑客攻击；未经授权使用或滥用玩家账户或登录ID；试图规避或绕过网站上或公司系统或网络上的任何安全机制；从第三方玩家账户转移或转移资金的错误企图；使用网站或公司服务对公司或任何第三方造成损害的任何作为或不作为；提供虚假玩家ID；串通、勾结或密谋欺诈公司及/或“芯片倾销”；任何违反本条款和条件使用法律的作为和/或不作为；以及公司合理认为具有欺诈性的任何行为和/或疏忽；
      市场：与公司通过网站提供的特定事件相关的投注
    </p>
  </div>
  <!-- 隐私政策 -->
  <div data-v-4618b748="" v-if="type == 6" data-v-f531b812="" class="privicy-rule"> 一旦注册即表示我已年满18周岁，且已阅读、接受并同意有关年龄验证和KYC（身份验证过程）的[条款与规则]、[隐私政策]，Cookies政策及其他政策 </div>
</div>

</template>
<script>
export default {
  name: 'abouts',
  data() {
    return {
      type: 0,
    };
  },
  created() {
    let that = this;
    var query = that.$route.query;
    if (query.type) {
      that.type = query.type;
    }
  },
  methods: {},
  mounted() {
    let that = this;
  },
  updated() {
    let that = this;
  },
  beforeDestroy() {},
};
</script>
<style lang="scss" scoped>
// @import '../../../static/css/announcement_modal.css';
</style>
